Tekla Open API Reference for Tekla Structures 2025
StrandUnbondingData Class
 The StrandUnbondingData class represents the unbonding of a rebar strand.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.StrandUnbondingData
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class StrandUnbondingData
<SerializableAttribute>
Public NotInheritable Class StrandUnbondingData
The StrandUnbondingData type exposes the following members.
Constructors
Name | Description
StrandUnbondingData
 Initializes a new strand unbonding data instance with empty attributes.
Top
Properties
Name | Description
FromEnd
 The unbonding from the end of the strand.
FromStart
 The unbonding from the start of the strand.
MiddleToEnd
 The unbonding from the middle of the strand to the end of the strand.
MiddleToStart
 The unbonding from the middle of the strand to the start of the strand.
StrandIndex
 The index of the strand.
Top
Examples
using Tekla.Structures.Model;
public class Example
{
       public void Example1()
       {
           StrandUnbondingData Unbonding = new StrandUnbondingData();
           Unbonding.FromEnd = 20;
           Unbonding.FromStart = 20;
           Unbonding.MiddleToEnd = 30;
           Unbonding.MiddleToStart = 30;
           Unbonding.StrandIndex = 1;
       }
}
See Also
Reference
Tekla.Structures.Model Namespace